midatronics/midatronics-core/boards.txt
# Copyright (c) 2017 IOTEAM S.r.l. All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# IOTEAM Dustino
# ---------------------------------------
dustino_native.name=IOTEAM Dustino (Native USB Port)
dustino_native.vid.0=0x2341
dustino_native.pid.0=0xe00B
dustino_native.vid.1=0x2341
dustino_native.pid.1=0xe00C
dustino_native.upload.tool=arduino:bossac
dustino_native.upload.protocol=sam-ba
dustino_native.upload.maximum_size=262144
dustino_native.upload.use_1200bps_touch=true
dustino_native.upload.wait_for_upload_port=true
dustino_native.upload.native_usb=true
dustino_native.build.mcu=cortex-m0plus
dustino_native.build.f_cpu=48000000L
dustino_native.build.usb_product="IOTEAM Dustino"
dustino_native.build.board=IOTEAM_SAMD_DUSTINO
dustino_native.build.usb_manufacturer="Arrow"
dustino_native.build.core=arduino:arduino
dustino_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
dustino_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dustino_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
dustino_native.build.variant=Dustino
dustino_native.build.vid=0x2341
dustino_native.build.pid=0xe00C

# IOTEAM Production Board FAKE board
# ---------------------------------------
ProductionBoard.name=IOTEAM Production Board
ProductionBoard.vid.0=0xf123
ProductionBoard.pid.0=0xe001
ProductionBoard.vid.1=0xf123
ProductionBoard.pid.1=0xe004
ProductionBoard.upload.tool=arduino:bossac
ProductionBoard.upload.protocol=sam-ba
ProductionBoard.upload.maximum_size=262144
ProductionBoard.upload.use_1200bps_touch=true
ProductionBoard.upload.wait_for_upload_port=true
ProductionBoard.upload.native_usb=true
ProductionBoard.build.mcu=cortex-m0plus
ProductionBoard.build.f_cpu=48000000L
ProductionBoard.build.usb_product="IOTEAM Production Board"
ProductionBoard.build.board=IOTEAM_SAMD_DUSTINO
ProductionBoard.build.usb_manufacturer="Arrow"
ProductionBoard.build.core=arduino:arduino
ProductionBoard.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
ProductionBoard.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
ProductionBoard.build.openocdscript=openocd_scripts/arduino_zero.cfg
ProductionBoard.build.variant=Dustino
ProductionBoard.build.vid=0xf123
ProductionBoard.build.pid=0xe004

# IOTEAM MKR680
# -------------
mkr680.name=IOTEAM ITM-MKR680
mkr680.vid.0=0x04d8
mkr680.pid.0=0xef26
mkr680.vid.1=0x04d8
mkr680.pid.1=0xef25

mkr680.upload.tool=bossac
mkr680.upload.protocol=sam-ba
mkr680.upload.maximum_size=262144
mkr680.upload.use_1200bps_touch=true
mkr680.upload.wait_for_upload_port=true
mkr680.upload.native_usb=true
mkr680.build.mcu=cortex-m0plus
mkr680.build.f_cpu=48000000L
mkr680.build.usb_product="ITM-MKR680"
mkr680.build.usb_manufacturer="IOTEAM"
mkr680.build.board=SAMD_IOTEAM_MKR680
mkr680.build.core=arduino:arduino
mkr680.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags}
mkr680.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkr680.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkr680.build.variant=mkr680
mkr680.build.variant_system_lib=
mkr680.build.vid=0x04d8
mkr680.build.pid=0xef26
mkr680.bootloader.tool=openocd
mkr680.bootloader.file=mkr680/samd21_sam_ba_ioteam_mkr680.bin

# IOTEAM MKR680 w/ external programmer
# ------------------------------------
mkr680_edbg.name=IOTEAM ITM-MKR680 (via external programmer)
mkr680_edbg.vid.0=0x04d8
mkr680_edbg.pid.0=0xef26
mkr680_edbg.vid.1=0x04d8
mkr680_edbg.pid.1=0xef25

mkr680_edbg.upload.tool=openocd
mkr680_edbg.upload.protocol=sam-ba
mkr680_edbg.upload.maximum_size=262144
mkr680_edbg.upload.use_1200bps_touch=false
mkr680_edbg.upload.wait_for_upload_port=false
mkr680_edbg.upload.native_usb=false
mkr680_edbg.build.mcu=cortex-m0plus
mkr680_edbg.build.f_cpu=48000000L
mkr680_edbg.build.usb_product="ITM-MKR680"
mkr680_edbg.build.usb_manufacturer="IOTEAM"
mkr680_edbg.build.board=SAMD_IOTEAM_MKR680
mkr680_edbg.build.core=arduino:arduino
mkr680_edbg.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags}
mkr680_edbg.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
mkr680_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkr680_edbg.build.variant=mkr680
mkr680_edbg.build.variant_system_lib=
mkr680_edbg.build.vid=0x04d8
mkr680_edbg.build.pid=0xef26
mkr680_edbg.bootloader.tool=openocd
mkr680_edbg.bootloader.file=mkr680/samd21_sam_ba_ioteam_mkr680.bin



